Rahix/avr-device/vendor/at90can32.atdf
    <module caption="Analog Comparator" name="AC">
      <register-group caption="Analog Comparator" name="AC">
        <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
          <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x40" name="ACME"/>
        </register>
        <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x50" size="1" ocd-rw="R">
          <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
          <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
          <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
          <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
          <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
          <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
          <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS" values="ANALOG_COMP_INTERRUPT"/>
        </register>
        <register name="DIDR1" offset="0x7F" size="1">
          <bitfield caption="AIN1 Digital Input Disable" mask="0x02" name="AIN1D"/>
          <bitfield caption="AIN0 Digital Input Disable" mask="0x01" name="AIN0D"/>
        </register>
      </register-group>
      <value-group name="ANALOG_COMP_INTERRUPT">
        <value caption="Interrupt on Toggle" name="INTERRUPT_ON_TOGGLE" value="0x00"/>
        <value caption="Reserved" name="RESERVED" value="0x01"/>
        <value caption="Interrupt on Falling Edge" name="INTERRUPT_ON_FALLING_EDGE" value="0x02"/>
        <value caption="Interrupt on Rising Edge" name="INTERRUPT_ON_RISING_EDGE" value="0x03"/>
      </value-group>
    </module>
    <module caption="Controller Area Network" name="CAN">
      <register-group caption="Controller Area Network" name="CAN">
        <register caption="CAN General Control Register" name="CANGCON" offset="0xD8" size="1">
          <bitfield caption="Abort Request" mask="0x80" name="ABRQ"/>
          <bitfield caption="Overload Frame Request" mask="0x40" name="OVRQ"/>
          <bitfield caption="Time Trigger Communication" mask="0x20" name="TTC"/>
          <bitfield caption="Synchronization of TTC" mask="0x10" name="SYNTTC"/>
          <bitfield caption="Listening Mode" mask="0x08" name="LISTEN"/>
          <bitfield caption="Test Mode" mask="0x04" name="TEST"/>
          <bitfield caption="Enable / Standby" mask="0x02" name="ENASTB"/>
          <bitfield caption="Software Reset Request" mask="0x01" name="SWRES"/>
        </register>
        <register caption="CAN General Status Register" name="CANGSTA" offset="0xD9" size="1" ocd-rw="R">
          <bitfield caption="Overload Frame Flag" mask="0x40" name="OVRG"/>
          <bitfield caption="Transmitter Busy" mask="0x10" name="TXBSY"/>
          <bitfield caption="Receiver Busy" mask="0x08" name="RXBSY"/>
          <bitfield caption="Enable Flag" mask="0x04" name="ENFG"/>
          <bitfield caption="Bus Off Mode" mask="0x02" name="BOFF"/>
          <bitfield caption="Error Passive Mode" mask="0x01" name="ERRP"/>
        </register>
        <register caption="CAN General Interrupt Register" name="CANGIT" offset="0xDA" size="1" ocd-rw="R">
          <bitfield caption="General Interrupt Flag" mask="0x80" name="CANIT"/>
          <bitfield caption="Bus Off Interrupt Flag" mask="0x40" name="BOFFIT"/>
          <bitfield caption="Overrun CAN Timer" mask="0x20" name="OVRTIM"/>
          <bitfield caption="Burst Receive Interrupt" mask="0x10" name="BXOK"/>
          <bitfield caption="Stuff Error General" mask="0x08" name="SERG"/>
          <bitfield caption="CRC Error General" mask="0x04" name="CERG"/>
          <bitfield caption="Form Error General" mask="0x02" name="FERG"/>
          <bitfield caption="Acknowledgement Error General" mask="0x01" name="AERG"/>
        </register>
        <register caption="CAN General Interrupt Enable Register" name="CANGIE" offset="0xDB" size="1">
          <bitfield caption="Enable all Interrupts" mask="0x80" name="ENIT"/>
          <bitfield caption="Enable Bus Off INterrupt" mask="0x40" name="ENBOFF"/>
          <bitfield caption="Enable Receive Interrupt" mask="0x20" name="ENRX"/>
          <bitfield caption="Enable Transmit Interrupt" mask="0x10" name="ENTX"/>
          <bitfield caption="Enable MOb Error Interrupt" mask="0x08" name="ENERR"/>
          <bitfield caption="Enable Burst Receive Interrupt" mask="0x04" name="ENBX"/>
          <bitfield caption="Enable General Error Interrupt" mask="0x02" name="ENERG"/>
          <bitfield caption="Enable CAN Timer Overrun Interrupt" mask="0x01" name="ENOVRT"/>
        </register>
        <register caption="Enable MOb Register" name="CANEN2" offset="0xDC" size="1" mask="0xFF" ocd-rw="R">
          <bitfield caption="Enable MOb" mask="0xFF" name="ENMOB"/>
        </register>
        <register caption="Enable MOb Register" name="CANEN1" offset="0xDD" size="1" mask="0x7F" ocd-rw="R">
          <bitfield caption="Enable MOb" mask="0x7F" name="ENMOB" lsb="8"/>
        </register>
        <register caption="Enable Interrupt MOb Register" name="CANIE2" offset="0xDE" size="1" mask="0xFF">
          <bitfield caption="Interrupt Enable by MOb" mask="0xFF" name="IEMOB"/>
        </register>
        <register caption="Enable Interrupt MOb Register" name="CANIE1" offset="0xDF" size="1" mask="0x7F">
          <bitfield caption="Interrupt Enable by MOb" mask="0x7F" name="IEMOB" lsb="8"/>
        </register>
        <register caption="CAN Status Interrupt MOb Register" name="CANSIT2" offset="0xE0" size="1" mask="0xFF" ocd-rw="R">
          <bitfield caption="Status of Interrupt by MOb" mask="0xFF" name="SIT"/>
        </register>
        <register caption="CAN Status Interrupt MOb Register" name="CANSIT1" offset="0xE1" size="1" mask="0x7F" ocd-rw="R">
          <bitfield caption="Status of Interrupt by MOb" mask="0x7F" name="SIT" lsb="8"/>
        </register>
