Rahix/avr-device/vendor/at90can32.atdf
        <register caption="Bit Timing Register 1" name="CANBT1" offset="0xE2" size="1">
          <bitfield caption="Baud Rate Prescaler bits" mask="0x7E" name="BRP"/>
        </register>
        <register caption="Bit Timing Register 2" name="CANBT2" offset="0xE3" size="1">
          <bitfield caption="Re-Sync Jump Width" mask="0x60" name="SJW"/>
          <bitfield caption="Propagation Time Segment" mask="0x0E" name="PRS"/>
        </register>
        <register caption="Bit Timing Register 3" name="CANBT3" offset="0xE4" size="1">
          <bitfield caption="Phase Segments" mask="0x70" name="PHS2"/>
          <bitfield caption="Phase Segment 1" mask="0x0E" name="PHS1"/>
          <bitfield caption="Sample Type" mask="0x01" name="SMP"/>
        </register>
        <register caption="Timer Control Register" name="CANTCON" offset="0xE5" size="1" mask="0xFF">
          <bitfield caption="CAN Timer Prescaler" mask="0xFF" name="TPRSC"/>
        </register>
        <register caption="Timer Register" name="CANTIM" offset="0xE6" size="2" ocd-rw="R">
          <bitfield caption="CAN Timer Count" mask="0xFFFF" name="CANTIM"/>
        </register>
        <register caption="TTC Timer Register" name="CANTTC" offset="0xE8" size="2" ocd-rw="R">
          <bitfield caption="TTC Timer Count" mask="0xFFFF" name="TIMTTC"/>
        </register>
        <register caption="Transmit Error Counter Register" name="CANTEC" offset="0xEA" size="1" mask="0xFF" ocd-rw="R">
          <bitfield caption="Transmit Error Count" mask="0xFF" name="TEC"/>
        </register>
        <register caption="Receive Error Counter Register" name="CANREC" offset="0xEB" size="1" mask="0xFF" ocd-rw="R">
          <bitfield caption="Receive Error Count" mask="0xFF" name="REC"/>
        </register>
        <register caption="Highest Priority MOb Register" name="CANHPMOB" offset="0xEC" size="1">
          <bitfield caption="Highest Priority MOb number" mask="0xF0" name="HPMOB"/>
          <bitfield caption="CAN General purpose bits" mask="0x0F" name="CGP" rw="R"/>
        </register>
        <register caption="Page MOb Register" name="CANPAGE" offset="0xED" size="1">
          <bitfield caption="MOb Number Bits" mask="0xF0" name="MOBNB"/>
          <bitfield caption="MOb Data Buffer Auto Increment" mask="0x08" name="AINC"/>
          <bitfield caption="Data Buffer Index Bits" mask="0x07" name="INDX"/>
        </register>
        <register caption="MOb Status Register" name="CANSTMOB" offset="0xEE" size="1">
          <bitfield caption="Data Length Code Warning" mask="0x80" name="DLCW"/>
          <bitfield caption="Transmit OK" mask="0x40" name="TXOK"/>
          <bitfield caption="Receive OK" mask="0x20" name="RXOK"/>
          <bitfield caption="Bit Error" mask="0x10" name="BERR"/>
          <bitfield caption="Stuff Error" mask="0x08" name="SERR"/>
          <bitfield caption="CRC Error" mask="0x04" name="CERR"/>
          <bitfield caption="Form Error" mask="0x02" name="FERR"/>
          <bitfield caption="Acknowledgement Error" mask="0x01" name="AERR"/>
        </register>
        <register caption="MOb Control and DLC Register" name="CANCDMOB" offset="0xEF" size="1">
          <bitfield caption="MOb Config Bits" mask="0xC0" name="CONMOB"/>
          <bitfield caption="Reply Valid" mask="0x20" name="RPLV"/>
          <bitfield caption="Identifier Extension" mask="0x10" name="IDE"/>
          <bitfield caption="Data Length Code Bits" mask="0x0F" name="DLC"/>
        </register>
        <register caption="Identifier Tag Register 4" name="CANIDT4" offset="0xF0" size="1" mask="0xFF">
          <bitfield caption="Identifier Tag" mask="0xF8" name="IDT"/>
          <bitfield caption="Remote Transmission Request Tag" mask="0x04" name="RTRTAG"/>
          <bitfield caption="Reserved Bit 1 Tag" mask="0x02" name="RB1TAG"/>
          <bitfield caption="Reserved Bit 0 Tag" mask="0x01" name="RB0TAG"/>
        </register>
        <register caption="Identifier Tag Register 3" name="CANIDT3" offset="0xF1" size="1" mask="0xFF">
          <bitfield caption="Identifier Tag" mask="0xFF" name="IDT" lsb="5"/>
        </register>
        <register caption="Identifier Tag Register 2" name="CANIDT2" offset="0xF2" size="1" mask="0xFF">
          <bitfield caption="Identifier Tag" mask="0xFF" name="IDT" lsb="13"/>
        </register>
        <register caption="Identifier Tag Register 1" name="CANIDT1" offset="0xF3" size="1" mask="0xFF">
          <bitfield caption="Identifier Tag" mask="0xFF" name="IDT" lsb="21"/>
        </register>
        <register caption="Identifier Mask Register 4" name="CANIDM4" offset="0xF4" size="1">
          <bitfield caption="Identifier Mask" mask="0xF8" name="IDMSK"/>
          <bitfield caption="Remote Transmission Request Mask" mask="0x04" name="RTRMSK"/>
          <bitfield caption="Identifier Extension Mask" mask="0x01" name="IDEMSK"/>
        </register>
        <register caption="Identifier Mask Register 3" name="CANIDM3" offset="0xF5" size="1">
          <bitfield caption="Identifier Mask" mask="0xFF" name="IDMSK" lsb="5"/>
        </register>
        <register caption="Identifier Mask Register 2" name="CANIDM2" offset="0xF6" size="1">
          <bitfield caption="Identifier Mask" mask="0xFF" name="IDMSK" lsb="13"/>
        </register>
        <register caption="Identifier Mask Register 1" name="CANIDM1" offset="0xF7" size="1">
          <bitfield caption="Identifier Mask" mask="0xFF" name="IDMSK" lsb="21"/>
        </register>
        <register caption="Time Stamp Register" name="CANSTM" offset="0xF8" size="2" mask="0xFFFF" ocd-rw="R">
          <bitfield caption="Time Stamp Count" mask="0xFFFF" name="TIMSTM"/>
        </register>
        <register caption="Message Data Register" name="CANMSG" offset="0xFA" size="1" mask="0xFF">
          <bitfield caption="Message Data" mask="0xFF" name="MSG"/>
        </register>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="TQFP64" caption="TQFP64">
      <pin position="1" pad="NC"/>
      <pin position="2" pad="PE0"/>
      <pin position="3" pad="PE1"/>
      <pin position="4" pad="PE2"/>
      <pin position="5" pad="PE3"/>
      <pin position="6" pad="PE4"/>
      <pin position="7" pad="PE5"/>
      <pin position="8" pad="PE6"/>
      <pin position="9" pad="PE7"/>
      <pin position="10" pad="PB0"/>
      <pin position="11" pad="PB1"/>
      <pin position="12" pad="PB2"/>
      <pin position="13" pad="PB3"/>
      <pin position="14" pad="PB4"/>
      <pin position="15" pad="PB5"/>
      <pin position="16" pad="PB6"/>
      <pin position="17" pad="PB7"/>
      <pin position="18" pad="PG3"/>
      <pin position="19" pad="PG4"/>
      <pin position="20" pad="RESET"/>
      <pin position="21" pad="VCC"/>
      <pin position="22" pad="GND"/>
      <pin position="23" pad="XTAL2"/>
      <pin position="24" pad="XTAL1"/>
      <pin position="25" pad="PD0"/>
      <pin position="26" pad="PD1"/>
      <pin position="27" pad="PD2"/>
      <pin position="28" pad="PD3"/>
      <pin position="29" pad="PD4"/>
      <pin position="30" pad="PD5"/>
      <pin position="31" pad="PD6"/>
      <pin position="32" pad="PD7"/>
      <pin position="33" pad="PG0"/>
      <pin position="34" pad="PG1"/>
      <pin position="35" pad="PC0"/>
      <pin position="36" pad="PC1"/>
      <pin position="37" pad="PC2"/>
      <pin position="38" pad="PC3"/>
      <pin position="39" pad="PC4"/>
      <pin position="40" pad="PC5"/>
      <pin position="41" pad="PC6"/>
      <pin position="42" pad="PC7"/>
      <pin position="43" pad="PG2"/>
      <pin position="44" pad="PA7"/>
      <pin position="45" pad="PA6"/>
      <pin position="46" pad="PA5"/>
      <pin position="47" pad="PA4"/>
      <pin position="48" pad="PA3"/>
      <pin position="49" pad="PA2"/>
      <pin position="50" pad="PA1"/>
      <pin position="51" pad="PA0"/>
      <pin position="52" pad="VCC"/>
      <pin position="53" pad="GND"/>
      <pin position="54" pad="PF7"/>
      <pin position="55" pad="PF6"/>
      <pin position="56" pad="PF5"/>
      <pin position="57" pad="PF4"/>
      <pin position="58" pad="PF3"/>
      <pin position="59" pad="PF2"/>
      <pin position="60" pad="PF1"/>
      <pin position="61" pad="PF0"/>
      <pin position="62" pad="AREF"/>
      <pin position="63" pad="GND"/>
      <pin position="64" pad="AVCC"/>
    </pinout>
    <pinout name="QFN64" caption="QFN64">
      <pin position="1" pad="NC"/>
      <pin position="2" pad="PE0"/>
      <pin position="3" pad="PE1"/>
      <pin position="4" pad="PE2"/>
      <pin position="5" pad="PE3"/>
      <pin position="6" pad="PE4"/>
      <pin position="7" pad="PE5"/>
      <pin position="8" pad="PE6"/>
      <pin position="9" pad="PE7"/>
      <pin position="10" pad="PB0"/>
      <pin position="11" pad="PB1"/>
      <pin position="12" pad="PB2"/>
      <pin position="13" pad="PB3"/>
      <pin position="14" pad="PB4"/>
      <pin position="15" pad="PB5"/>
      <pin position="16" pad="PB6"/>
      <pin position="17" pad="PB7"/>
      <pin position="18" pad="PG3"/>
      <pin position="19" pad="PG4"/>
      <pin position="20" pad="RESET"/>
      <pin position="21" pad="VCC"/>
      <pin position="22" pad="GND"/>
      <pin position="23" pad="XTAL2"/>
      <pin position="24" pad="XTAL1"/>
      <pin position="25" pad="PD0"/>
      <pin position="26" pad="PD1"/>
      <pin position="27" pad="PD2"/>
      <pin position="28" pad="PD3"/>
      <pin position="29" pad="PD4"/>
      <pin position="30" pad="PD5"/>
      <pin position="31" pad="PD6"/>
      <pin position="32" pad="PD7"/>
      <pin position="33" pad="PG0"/>
      <pin position="34" pad="PG1"/>
      <pin position="35" pad="PC0"/>
      <pin position="36" pad="PC1"/>
      <pin position="37" pad="PC2"/>
      <pin position="38" pad="PC3"/>
      <pin position="39" pad="PC4"/>
      <pin position="40" pad="PC5"/>
      <pin position="41" pad="PC6"/>
      <pin position="42" pad="PC7"/>
      <pin position="43" pad="PG2"/>
      <pin position="44" pad="PA7"/>
      <pin position="45" pad="PA6"/>
      <pin position="46" pad="PA5"/>
      <pin position="47" pad="PA4"/>
      <pin position="48" pad="PA3"/>
      <pin position="49" pad="PA2"/>
      <pin position="50" pad="PA1"/>
      <pin position="51" pad="PA0"/>
      <pin position="52" pad="VCC"/>
      <pin position="53" pad="GND"/>
      <pin position="54" pad="PF7"/>
      <pin position="55" pad="PF6"/>
      <pin position="56" pad="PF5"/>
      <pin position="57" pad="PF4"/>
      <pin position="58" pad="PF3"/>
      <pin position="59" pad="PF2"/>
      <pin position="60" pad="PF1"/>
      <pin position="61" pad="PF0"/>
      <pin position="62" pad="AREF"/>
      <pin position="63" pad="GND"/>
      <pin position="64" pad="AVCC"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
